---
type: FieldDomainPointsByUV
namespace: Autodesk.Revit.DB.Analysis
version: 2024
members: 2
tags: [revit-api, class]
---

# FieldDomainPointsByUV

`Autodesk.Revit.DB.Analysis.FieldDomainPointsByUV` · Revit 2024 · 2 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | FieldDomainPointsByUV | — | `` |
| Method | SetGridCoordinates | 2011 | `public void SetGridCoordinates ( ICollection < double > uCoordinates , ICollection < double > vCoordinates )` |